#### Terraform Initialization ⚙️　`success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan Result</summary>

```terraform
data.aws_ami.amazon_linux_2023_arm64: Reading...
data.aws_region.current: Reading...
data.aws_caller_identity.current: Reading...
data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
data.aws_caller_identity.current: Read complete after 0s [id=662478938633]
data.aws_iam_policy_document.ecr_repository_policy: Reading...
data.aws_iam_policy_document.ecr_repository_policy: Read complete after 0s [id=3861312900]
data.aws_ami.amazon_linux_2023_arm64: Read complete after 2s [id=ami-041466d95b195af5d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.media_bucket_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "media_bucket_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::wordpress-media-20260128114110973600000001/*",
            ]
          + sid       = "AllowCloudFrontServicePrincipal"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::662478938633:distribution/E3FAGMWM2NPZ8I",
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudfront_distribution.media will be updated in-place
  ~ resource "aws_cloudfront_distribution" "media" {
        id                              = "E3FAGMWM2NPZ8I"
        tags                            = {
            "Environment" = "prod"
            "ManagedBy"   = "Terraform"
            "Name"        = "wordpress-bedrock-prod-media-cdn"
            "Project"     = "wordpress-bedrock"
        }
        # (25 unchanged attributes hidden)

      ~ viewer_certificate {
          ~ minimum_protocol_version       = "TLSv1" -> "TLSv1.2_2021"
            # (4 unchanged attributes hidden)
        }

        # (10 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.media will be updated in-place
  ~ resource "aws_s3_bucket_policy" "media" {
        id     = "wordpress-media-20260128114110973600000001"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::662478938633:distribution/E3FAGMWM2NPZ8I"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::wordpress-media-20260128114110973600000001/*"
                      - Sid       = "AllowCloudFrontServicePrincipal"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @takahiro1226, Action: `pull_request`, Working Directory: `terraform`, Workflow: `Terraform Plan`*